<img style="float: left;;" src='../Figures/iteso.jpg' width="50" height="100"/></a>

# <center> <font color= #000047> Repaso de la Librería Pandas</font> </center>

# DataFrames

Los DataFrames son la principal herramienta de la librería de pandas y se inspiran directamente en el lenguaje de programación R. Podemos pensar en un DataFrame como un grupo de objetos Series juntos para compartir el mismo índice. ¡Usemos pandas para explorar este tema!

In [1]:
# Importar librerías
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4))
df

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [9]:
df

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [13]:
indices = 'A B C D E'.split()

In [11]:
'W X Y Z'.split()

['W', 'X', 'Y', 'Z']

In [14]:
df = pd.DataFrame(randn(5,4), index= indices, columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Selección e Indexación

Aprendamos los diversos métodos para obtener datos de un DataFrame

In [15]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [16]:
df.loc['B','W']

0.6812092925867574

In [17]:
df[['W','Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [18]:
df.W

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [19]:
df['conteo de alumnos'] = df['W']+df['Z']
df

          W         X         Y         Z  conteo de alumnos
A  0.386030  2.084019 -0.376519  0.230336           0.616367
B  0.681209  1.035125 -0.031160  1.939932           2.621142
C -1.005187 -0.741790  0.187125 -0.732845          -1.738032
D -1.382920  1.482495  0.961458 -2.141212          -3.524132
E  0.992573  1.192241 -1.046780  1.292765           2.285338

In [21]:
df.Y

A   -0.376519
B   -0.031160
C    0.187125
D    0.961458
E   -1.046780
Name: Y, dtype: float64

In [23]:
df['conteo de alumnos']

A    0.616367
B    2.621142
C   -1.738032
D   -3.524132
E    2.285338
Name: conteo de alumnos, dtype: float64

In [24]:
df.loc['B','W']

0.6812092925867574

In [28]:
df.iloc[1:,2:]

          Y         Z  conteo de alumnos
B -0.031160  1.939932           2.621142
C  0.187125 -0.732845          -1.738032
D  0.961458 -2.141212          -3.524132
E -1.046780  1.292765           2.285338

### Creando una nueva columna:

In [29]:
df['new'] = df['X'] - df['Y']

In [30]:
df

          W         X         Y         Z  conteo de alumnos       new
A  0.386030  2.084019 -0.376519  0.230336           0.616367  2.460537
B  0.681209  1.035125 -0.031160  1.939932           2.621142  1.066286
C -1.005187 -0.741790  0.187125 -0.732845          -1.738032 -0.928914
D -1.382920  1.482495  0.961458 -2.141212          -3.524132  0.521037
E  0.992573  1.192241 -1.046780  1.292765           2.285338  2.239020

### Eliminar Columnas

In [33]:
df.drop('conteo de alumnos', axis=1, inplace=True)

In [34]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
C -1.005187 -0.741790  0.187125 -0.732845 -0.928914
D -1.382920  1.482495  0.961458 -2.141212  0.521037
E  0.992573  1.192241 -1.046780  1.292765  2.239020

también podemos eliminar las columnas de esta forma:

### Seleccionar Columnas

df.loc[]
df.iloc

O seleccionar en base a la posición en vez de alguna etiqueta

### Seleccionar subconjunto de filas y columnas

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [41]:
df.iloc[:2,[0,2]]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

### Selección condicional

Una característica importante de los pandas es la selección condicional mediante notación de corchetes, muy similar a numpy:

In [42]:
df>0

       W      X      Y      Z    new
A   True   True  False   True   True
B   True   True  False   True   True
C  False  False   True  False  False
D  False   True   True  False   True
E   True   True  False   True   True

In [43]:
df[df>0]

          W         X         Y         Z       new
A  0.386030  2.084019       NaN  0.230336  2.460537
B  0.681209  1.035125       NaN  1.939932  1.066286
C       NaN       NaN  0.187125       NaN       NaN
D       NaN  1.482495  0.961458       NaN  0.521037
E  0.992573  1.192241       NaN  1.292765  2.239020

In [44]:
df[df['W']>0]

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
E  0.992573  1.192241 -1.046780  1.292765  2.239020

In [45]:
df[df['X']>0]

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
D -1.382920  1.482495  0.961458 -2.141212  0.521037
E  0.992573  1.192241 -1.046780  1.292765  2.239020

In [49]:
df[df['X']>0][['Z','X']]

          Z         X
A  0.230336  2.084019
B  1.939932  1.035125
D -2.141212  1.482495
E  1.292765  1.192241

Para dos condiciones, se puede usar los operadores | y & con paréntesis:

In [52]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
C -1.005187 -0.741790  0.187125 -0.732845 -0.928914
D -1.382920  1.482495  0.961458 -2.141212  0.521037
E  0.992573  1.192241 -1.046780  1.292765  2.239020

In [55]:
df[(df['W']>0) & (df['Z']>0)]

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
E  0.992573  1.192241 -1.046780  1.292765  2.239020

## Más detalles del índice

Analicemos algunas características más de la indexación, incluido el restablecimiento del índice o resetearlo a otro valor. ¡También hablaremos sobre la jerarquía de índices!

In [56]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  2.460537
B  0.681209  1.035125 -0.031160  1.939932  1.066286
C -1.005187 -0.741790  0.187125 -0.732845 -0.928914
D -1.382920  1.482495  0.961458 -2.141212  0.521037
E  0.992573  1.192241 -1.046780  1.292765  2.239020

In [57]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.386030  2.084019 -0.376519  0.230336  2.460537
1     B  0.681209  1.035125 -0.031160  1.939932  1.066286
2     C -1.005187 -0.741790  0.187125 -0.732845 -0.928914
3     D -1.382920  1.482495  0.961458 -2.141212  0.521037
4     E  0.992573  1.192241 -1.046780  1.292765  2.239020

In [59]:
newind= 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [61]:
df['states'] = newind
df

          W         X         Y         Z       new states
A  0.386030  2.084019 -0.376519  0.230336  2.460537     CA
B  0.681209  1.035125 -0.031160  1.939932  1.066286     NY
C -1.005187 -0.741790  0.187125 -0.732845 -0.928914     WY
D -1.382920  1.482495  0.961458 -2.141212  0.521037     OR
E  0.992573  1.192241 -1.046780  1.292765  2.239020     CO

In [64]:
df.set_index('states',inplace=True)

In [65]:
df

               W         X         Y         Z       new
states
CA      0.386030  2.084019 -0.376519  0.230336  2.460537
NY      0.681209  1.035125 -0.031160  1.939932  1.066286
WY     -1.005187 -0.741790  0.187125 -0.732845 -0.928914
OR     -1.382920  1.482495  0.961458 -2.141212  0.521037
CO      0.992573  1.192241 -1.046780  1.292765  2.239020

## DataFrame Resumen
Hay un par de formas de obtener datos resumidos en DataFrames.<br>
<tt><strong>df.describe()</strong></tt> proporciona estadísticas resumidas en todas las columnas numéricas.<br>
<tt><strong>df.info y df.dtypes</strong></tt> muestra el tipo de datos de todas las columnas.

In [66]:
df.describe()

              W         X         Y         Z       new
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.065659  1.010418 -0.061175  0.117795  1.071593
std    1.060611  1.058227  0.738104  1.623276  1.378153
min   -1.382920 -0.741790 -1.046780 -2.141212 -0.928914
25%   -1.005187  1.035125 -0.376519 -0.732845  0.521037
50%    0.386030  1.192241 -0.031160  0.230336  1.066286
75%    0.681209  1.482495  0.187125  1.292765  2.239020
max    0.992573  2.084019  0.961458  1.939932  2.460537

In [67]:
df.dtypes

W      float64
X      float64
Y      float64
Z      float64
new    float64
dtype: object

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
 4   new     5 non-null      float64
dtypes: float64(5)
memory usage: 240.0+ bytes